Oryx-Embedded/CycloneTCP/drivers/mac/stm32c5xx_eth_driver.c
/**
 * @file stm32c5xx_eth_driver.c
 * @brief STM32C5 Ethernet MAC driver
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "stm32_hal.h"
#include "core/net.h"
#include "drivers/mac/stm32c5xx_eth_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//Transmit buffer
#pragma data_alignment = ETH_BUS_DATA_WIDTH_BYTE
static uint8_t txBuffer[STM32C5XX_ETH_TX_BUFFER_COUNT][STM32C5XX_ETH_TX_BUFFER_SIZE];
//Receive buffer
#pragma data_alignment = ETH_BUS_DATA_WIDTH_BYTE
static uint8_t rxBuffer[STM32C5XX_ETH_RX_BUFFER_COUNT][STM32C5XX_ETH_RX_BUFFER_SIZE];
//Transmit DMA descriptors
#pragma data_alignment = ETH_BUS_DATA_WIDTH_BYTE
static Stm32c5xxTxDmaDesc txDmaDesc[STM32C5XX_ETH_TX_BUFFER_COUNT];
//Receive DMA descriptors
#pragma data_alignment = ETH_BUS_DATA_WIDTH_BYTE
static Stm32c5xxRxDmaDesc rxDmaDesc[STM32C5XX_ETH_RX_BUFFER_COUNT];

//Keil MDK-ARM or GCC compiler?
#else

//Transmit buffer
static uint8_t txBuffer[STM32C5XX_ETH_TX_BUFFER_COUNT][STM32C5XX_ETH_TX_BUFFER_SIZE]
   __attribute__((aligned(ETH_BUS_DATA_WIDTH_BYTE)));
//Receive buffer
static uint8_t rxBuffer[STM32C5XX_ETH_RX_BUFFER_COUNT][STM32C5XX_ETH_RX_BUFFER_SIZE]
   __attribute__((aligned(ETH_BUS_DATA_WIDTH_BYTE)));
//Transmit DMA descriptors
static Stm32c5xxTxDmaDesc txDmaDesc[STM32C5XX_ETH_TX_BUFFER_COUNT]
   __attribute__((aligned(ETH_BUS_DATA_WIDTH_BYTE)));
//Receive DMA descriptors
static Stm32c5xxRxDmaDesc rxDmaDesc[STM32C5XX_ETH_RX_BUFFER_COUNT]
   __attribute__((aligned(ETH_BUS_DATA_WIDTH_BYTE)));

#endif

//Current transmit descriptor
static uint_t txIndex;
//Current receive descriptor
static uint_t rxIndex;


/**
 * @brief STM32C5 Ethernet MAC driver
 **/

const NicDriver stm32c5xxEthDriver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   stm32c5xxEthInit,
   stm32c5xxEthTick,
   stm32c5xxEthEnableIrq,
   stm32c5xxEthDisableIrq,
   stm32c5xxEthEventHandler,
   stm32c5xxEthSendPacket,
   stm32c5xxEthUpdateMacAddrFilter,
   stm32c5xxEthUpdateMacConfig,
   stm32c5xxEthWritePhyReg,
   stm32c5xxEthReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief STM32C5 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t stm32c5xxEthInit(NetInterface *interface)
{
   error_t error;
   uint32_t temp;

   //Debug message
   TRACE_INFO("Initializing STM32C5 Ethernet MAC...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //GPIO configuration
   stm32c5xxEthInitGpio(interface);

   //Enable Ethernet MAC clock
   HAL_RCC_ETH1_EnableClock();
   HAL_RCC_ETH1CK_EnableClock();
   HAL_RCC_ETH1TX_EnableClock();
   HAL_RCC_ETH1RX_EnableClock();

   //Reset Ethernet MAC peripheral
   HAL_RCC_ETH1_Reset();

   //Perform a software reset
   ETH1->DMAMR |= ETH_DMAMR_SWR;
   //Wait for the reset to complete
   while((ETH1->DMAMR & ETH_DMAMR_SWR) != 0)
   {
   }

   //Adjust MDC clock range depending on HCLK frequency
   ETH1->MACMDIOAR = ETH_MACMDIOAR_CR_Val(5);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Use default MAC configuration
   ETH1->MACCR = ETH_MACCR_GPSLCE | ETH_MACCR_RESERVED15 | ETH_MACCR_DO;

   //Set the maximum packet size that can be accepted
   temp = ETH1->MACECR & ~ETH_MACECR_GPSL;
   ETH1->MACECR = temp | STM32C5XX_ETH_RX_BUFFER_SIZE;

   //Configure MAC address filtering
   stm32c5xxEthUpdateMacAddrFilter(interface);

   //Disable flow control
   ETH1->MACQTXFCR = 0;
   ETH1->MACRXFCR = 0;

   //Configure DMA operating mode
   ETH1->DMAMR = ETH_DMAMR_INTM_Val(0) | ETH_DMAMR_TXPR_Val(0);
   //Configure system bus mode
   ETH1->DMASBMR |= ETH_DMASBMR_AAL;
   //The DMA takes the descriptor table as contiguous
   ETH1->DMACCR = ETH_DMACCR_DSL_Val(0);

   //Configure TX features
   ETH1->DMACTXCR = ETH_DMACTXCR_TXPBL_Val(32);

   //Configure RX features
   ETH1->DMACRXCR = ETH_DMACRXCR_RXPBL_Val(32) |
      ETH_DMACRXCR_RBSZ_Val(STM32C5XX_ETH_RX_BUFFER_SIZE);

   //Enable store and forward mode
   ETH1->MTLTXQOMR |= ETH_MTLTXQOMR_TSF;
   ETH1->MTLRXQOMR |= ETH_MTLRXQOMR_RSF;

   //Initialize DMA descriptor lists
   stm32c5xxEthInitDmaDesc(interface);

   //Prevent interrupts from being generated when the transmit statistic
   //counters reach half their maximum value
   ETH1->MMC_TX_INTERRUPT_MASK = ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM |
      ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM | ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM |
      ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM | ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM;

   //Prevent interrupts from being generated when the receive statistic
   //counters reach half their maximum value
   ETH1->MMC_RX_INTERRUPT_MASK = ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM |
      ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM | ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM |
      ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM | ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM;

