Oryx-Embedded/CycloneTCP/drivers/mac/stm32c5xx_eth_driver.c
   //Disable MAC interrupts
   ETH1->MACIER = 0;
   //Enable the desired DMA interrupts
   ETH1->DMACIER = ETH_DMACIER_NIE | ETH_DMACIER_RIE | ETH_DMACIER_TIE;

   //Set priority grouping (4 bits for pre-emption priority, no bits for subpriority)
   NVIC_SetPriorityGrouping(STM32C5XX_ETH_IRQ_PRIORITY_GROUPING);

   //Configure Ethernet interrupt priority
   NVIC_SetPriority(ETH1_IRQn, NVIC_EncodePriority(STM32C5XX_ETH_IRQ_PRIORITY_GROUPING,
      STM32C5XX_ETH_IRQ_GROUP_PRIORITY, STM32C5XX_ETH_IRQ_SUB_PRIORITY));

   //Enable MAC transmission and reception
   ETH1->MACCR |= ETH_MACCR_TE | ETH_MACCR_RE;

   //Enable DMA transmission and reception
   ETH1->DMACTXCR |= ETH_DMACTXCR_ST;
   ETH1->DMACRXCR |= ETH_DMACRXCR_SR;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

__weak_func void stm32c5xxEthInitGpio(NetInterface *interface)
{
//Nucleo-C5A3ZG evaluation board?
#if defined(USE_NUCLEO_C5A3ZG)
   hal_gpio_config_t gpio_config;

   //Enable SBS clock
   HAL_RCC_SBS_EnableClock();

   //Enable GPIO clocks
   HAL_RCC_GPIOA_EnableClock();
   HAL_RCC_GPIOC_EnableClock();
   HAL_RCC_GPIOD_EnableClock();
   HAL_RCC_GPIOE_EnableClock();
   HAL_RCC_GPIOG_EnableClock();

   //Select RMII interface mode
   HAL_SBS_SetETHPHYInterface(ETH1, HAL_SBS_ETHPHY_ITF_RMII);

   //Configure RMII pins
   gpio_config.mode = HAL_GPIO_MODE_ALTERNATE;
   gpio_config.output_type = HAL_GPIO_OUTPUT_PUSHPULL;
   gpio_config.pull = HAL_GPIO_PULL_NO;
   gpio_config.speed = HAL_GPIO_SPEED_FREQ_VERY_HIGH;

   //Configure ETH1_RMII_REF_CLK (PA1)
   gpio_config.alternate = HAL_GPIO_AF_10;
   HAL_GPIO_Init(HAL_GPIOA, HAL_GPIO_PIN_1, &gpio_config);

   //Configure ETH1_MDC (PC1)
   gpio_config.alternate = HAL_GPIO_AF_10;
   HAL_GPIO_Init(HAL_GPIOC, HAL_GPIO_PIN_1, &gpio_config);

   //Configure ETH1_RMII_RXD0 (PC4)
   gpio_config.alternate = HAL_GPIO_AF_12;
   HAL_GPIO_Init(HAL_GPIOC, HAL_GPIO_PIN_4, &gpio_config);

   //Configure ETH1_RMII_RXD1 (PC5)
   gpio_config.alternate = HAL_GPIO_AF_13;
   HAL_GPIO_Init(HAL_GPIOC, HAL_GPIO_PIN_5, &gpio_config);

   //Configure ETH1_RMII_CRS_DV (PD1)
   gpio_config.alternate = HAL_GPIO_AF_10;
   HAL_GPIO_Init(HAL_GPIOD, HAL_GPIO_PIN_1, &gpio_config);

   //Configure ETH1_MDIO (PE12)
   gpio_config.alternate = HAL_GPIO_AF_10;
   HAL_GPIO_Init(HAL_GPIOE, HAL_GPIO_PIN_12, &gpio_config);

   //Configure RMII_TX_EN (PG11)
   gpio_config.alternate = HAL_GPIO_AF_10;
   HAL_GPIO_Init(HAL_GPIOG, HAL_GPIO_PIN_11, &gpio_config);

   //Configure ETH1_RMII_TXD1 (PG12)
   gpio_config.alternate = HAL_GPIO_AF_10;
   HAL_GPIO_Init(HAL_GPIOG, HAL_GPIO_PIN_12, &gpio_config);

   //Configure ETH1_RMII_TXD0 (PG13)
   gpio_config.alternate = HAL_GPIO_AF_10;
   HAL_GPIO_Init(HAL_GPIOG, HAL_GPIO_PIN_13, &gpio_config);

   //Select ETH1 clock source
   HAL_RCC_ETH1_SetKernelClkSource(HAL_RCC_ETH1_CLK_SRC_HSE);
   //Select ETH1REF clock source
   HAL_RCC_ETH1REF_SetKernelClkSource(HAL_RCC_ETH1REF_CLK_SRC_RMII);
#endif
}


/**
 * @brief Initialize DMA descriptor lists
 * @param[in] interface Underlying network interface
 **/

void stm32c5xxEthInitDmaDesc(NetInterface *interface)
{
   uint_t i;

   //Initialize TX DMA descriptor list
   for(i = 0; i < STM32C5XX_ETH_TX_BUFFER_COUNT; i++)
   {
      //The descriptor is initially owned by the application
      txDmaDesc[i].tdes0 = 0;
      txDmaDesc[i].tdes1 = 0;
      txDmaDesc[i].tdes2 = 0;
      txDmaDesc[i].tdes3 = 0;
   }

   //Initialize TX descriptor index
   txIndex = 0;

   //Initialize RX DMA descriptor list
   for(i = 0; i < STM32C5XX_ETH_RX_BUFFER_COUNT; i++)
   {
      //The descriptor is initially owned by the DMA
      rxDmaDesc[i].rdes0 = (uint32_t) rxBuffer[i];
      rxDmaDesc[i].rdes1 = 0;
      rxDmaDesc[i].rdes2 = 0;
      rxDmaDesc[i].rdes3 = ETH_RDES3_OWN | ETH_RDES3_IOC | ETH_RDES3_BUF1V;
   }

   //Initialize RX descriptor index
   rxIndex = 0;

   //Start location of the TX descriptor list
   ETH1->DMACTXDLAR = (uint32_t) &txDmaDesc[0];
   //Length of the transmit descriptor ring
   ETH1->DMACTXRLR = STM32C5XX_ETH_TX_BUFFER_COUNT - 1;

   //Start location of the RX descriptor list
   ETH1->DMACRXDLAR = (uint32_t) &rxDmaDesc[0];
   //Length of the receive descriptor ring
   ETH1->DMACRXRLR = STM32C5XX_ETH_RX_BUFFER_COUNT - 1;
}


/**
 * @brief STM32C5 Ethernet MAC timer handler
 *
 * This routine is periodically called by the TCP/IP stack to handle periodic
 * operations such as polling the link state
 *
 * @param[in] interface Underlying network interface
 **/

void stm32c5xxEthTick(NetInterface *interface)
{
   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Handle periodic operations
      interface->phyDriver->tick(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Handle periodic operations
      interface->switchDriver->tick(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Enable interrupts
 * @param[in] interface Underlying network interface
 **/

void stm32c5xxEthEnableIrq(NetInterface *interface)
{
   //Enable Ethernet MAC interrupts
   NVIC_EnableIRQ(ETH1_IRQn);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Enable Ethernet PHY interrupts
      interface->phyDriver->enableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Enable Ethernet switch interrupts
      interface->switchDriver->enableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Disable interrupts
 * @param[in] interface Underlying network interface
 **/

void stm32c5xxEthDisableIrq(NetInterface *interface)
{
   //Disable Ethernet MAC interrupts
   NVIC_DisableIRQ(ETH1_IRQn);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Disable Ethernet PHY interrupts
      interface->phyDriver->disableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Disable Ethernet switch interrupts
      interface->switchDriver->disableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief STM32C5 Ethernet MAC interrupt service routine
 **/

void ETH1_IRQHandler(void)
{
   bool_t flag;
   uint32_t status;

   //Interrupt service routine prologue
   osEnterIsr();

   //This flag will be set if a higher priority task must be woken
   flag = FALSE;

   //Read DMA status register
   status = ETH1->DMACSR;

   //Packet transmitted?
   if((status & ETH_DMACSR_TI) != 0)
   {
      //Clear TI interrupt flag
      ETH1->DMACSR = ETH_DMACSR_TI;

